# YOLO11n-pose-micro：輕量化姿態檢測模型

# 參數
nc: 1  # 類別數量
kpt_shape: [17, 3]  # 關鍵點數量，維度 (x,y,visible)

scales: # model compound scaling constants
  # [depth, width, max_channels]
  custom: [1.00, 1.00, 1024]

# 骨幹網絡
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [16, 3, 2]]  # 1-P2/4
  - [-1, 1, C3k2, [32, False, 0.25]]  # 2
  - [-1, 1, Conv, [32, 3, 2]]  # 3-P3/8
  - [-1, 1, C3k2, [64, False, 0.25]]  # 4
  - [-1, 1, Conv, [64, 3, 2]]  # 5-P4/16
  - [-1, 1, C3k2, [64, True]]  # 6
  - [-1, 1, Conv, [128, 3, 2]]  # 7-P5/32
  - [-1, 1, C3k2, [128, True]]  # 8
  - [-1, 1, SPPF, [128, 5]]  # 9
  - [-1, 1, C2PSA, [128, 0.5]]  # 10 (減少內部通道數)

# 檢測頭
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]  # 12 cat backbone P4
  - [-1, 1, C3k2, [64, False]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]  # 15 cat backbone P3
  - [-1, 1, C3k2, [32, False]]  # 16 (P3/8-small)

  - [-1, 1, Conv, [32, 3, 2]]  # 17
  - [[-1, 13], 1, Concat, [1]]  # 18 cat head P4
  - [-1, 1, C3k2, [64, False]]  # 19 (P4/16-medium)

  - [-1, 1, Conv, [64, 3, 2]]  # 20
  - [[-1, 10], 1, Concat, [1]]  # 21 cat head P5
  - [-1, 1, C3k2, [128, True]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, Pose, [nc, kpt_shape]]  # 23 Pose(P3, P4, P5)